Tasks/FlatChannel/0_org/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);
U -0.001;
boundaryField
{
    outlet
    {
        type            zeroGradient;
    }
    
    inlet
    {
        type            fixedValue;
        value           uniform (0 ${U} 0);
    }
    
    frontWall
    {
        type            empty;
    }
    
    backWall
    {
         type           empty;
    }
    
    sideWall
    {
        type            noSlip;
    }
}


// ************************************************************************* //
