Tasks/FlatChannel/0_org/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;
boundaryField
{
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    
    inlet
    {
        type            zeroGradient;
    }
    
    frontWall
    {
        type            empty;
    }
    
    backWall
    {
         type           empty;
    }
    
    sideWall
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
