Tasks/FlatChannel/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    frontWall
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          6440;
        startFace       12590;
    }
    backWall
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          6440;
        startFace       19030;
    }
    sideWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          518;
        startFace       25470;
    }
    outlet
    {
        type            patch;
        nFaces          12;
        startFace       25988;
    }
    inlet
    {
        type            patch;
        nFaces          50;
        startFace       26000;
    }
)

// ************************************************************************* //
